###  Results for `terraform plan` on `lambda` 

<details>
<summary>Show output</summary>

```diff
module.lambda.data.external.archive_prepare[0]: Reading...
module.lambda.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.lambda.data.aws_iam_policy_document.assume_role[0]: Reading...
module.eventbridge.data.aws_cloudwatch_event_bus.this[0]: Reading...
module.eventbridge.data.aws_partition.current: Reading...
module.eventbridge.data.aws_caller_identity.current: Reading...
module.lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.eventbridge.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda.data.aws_caller_identity.current: Reading...
module.eventbridge.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda.data.aws_region.current: Reading...
module.lambda.data.aws_partition.current: Reading...
module.eventbridge.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3959961479]
module.eventbridge.data.aws_region.current: Reading...
module.lambda.data.aws_region.current: Read complete after 0s [id=us-east-2]
module.lambda.data.aws_partition.current: Read complete after 0s [id=aws]
module.eventbridge.data.aws_region.current: Read complete after 0s [id=us-east-2]
module.lambda.data.aws_caller_identity.current: Read complete after 0s [id=891377079132]
module.eventbridge.data.aws_caller_identity.current: Read complete after 0s [id=891377079132]
module.eventbridge.data.aws_cloudwatch_event_bus.this[0]: Read complete after 0s [id=default]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.eventbridge.aws_cloudwatch_event_rule.this["crons-1mins"] will be created
  + resource "aws_cloudwatch_event_rule" "this" {
      + arn                 = (known after apply)
      + description         = "Trigger for a Lambda cron 1 minutes"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "crons-1mins-rule"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(*/1 * * * ? *)"
      + tags                = {
          + "Name" = "crons-1mins-rule"
        }
      + tags_all            = {
          + "Backup"      = "false"
          + "Entity"      = "playground"
          + "Environment" = "dev"
          + "Name"        = "crons-1mins-rule"
          + "Owner"       = "infraestructura"
          + "Tier"        = (known after apply)
          + "Workload"    = "aplicativo"
        }
    }

  # module.eventbridge.aws_cloudwatch_event_target.this["test-githubciosns-pre-playground"] will be created
  + resource "aws_cloudwatch_event_target" "this" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "crons-1mins-rule"
      + target_id      = (known after apply)
    }

  # module.eventbridge.aws_iam_role.eventbridge[0] will be created
  + resource "aws_iam_role" "eventbridge" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "role-eventbridge-test-githubciosns-pre-playground-playground"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "role-eventbridge-test-githubciosns-pre-playground-playground"
        }
      + tags_all              = {
          + "Backup"      = "false"
          + "Entity"      = "playground"
          + "Environment" = "dev"
          + "Name"        = "role-eventbridge-test-githubciosns-pre-playground-playground"
          + "Owner"       = "infraestructura"
          + "Tier"        = (known after apply)
          + "Workload"    = "aplicativo"
        }
      + unique_id             = (known after apply)
    }

  # module.lambda.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.lambda.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/test-githubciosns-pre-playground"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.lambda.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "test-githubciosns-pre-playground-logs"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.lambda.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "test-githubciosns-pre-playground"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.lambda.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "test-githubciosns-pre-playground"
    }

  # module.lambda.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "test-githubciosns-pre-playground"
      + filename                       = "builds/dfee488785f0e3ae0828e284a1b2b1001d332f29c7971fc18590e5e31ae4df2d.zip"
      + function_name                  = "test-githubciosns-pre-playground"
      + handler                        = "index.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.13"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Backup"                = "false"
          + "Entity"                = "playground"
          + "Environment"           = "dev"
          + "Name"                  = "test-githubciosns-pre-playground"
          + "Owner"                 = "infraestructura"
          + "Tier"                  = (known after apply)
          + "Workload"              = "aplicativo"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "API_BASE_URL" = "dev-prextamos.prexcard.com.ar"
              + "API_KEY"      = "1231abcd"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }
    }

  # module.lambda.aws_lambda_permission.unqualified_alias_triggers["crons-1mins"] will be created
  + resource "aws_lambda_permission" "unqualified_alias_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "test-githubciosns-pre-playground"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = "crons-1mins"
    }

  # module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "./lambda_code/index.py",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/dfee488785f0e3ae0828e284a1b2b1001d332f29c7971fc18590e5e31ae4df2d.zip"
              + runtime       = "python3.13"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/dfee488785f0e3ae0828e284a1b2b1001d332f29c7971fc18590e5e31ae4df2d.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/dfee488785f0e3ae0828e284a1b2b1001d332f29c7971fc18590e5e31ae4df2d.zip"
          + "timestamp" = "1736974451755764000"
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + lambda_function_arn  = (known after apply)
  + lambda_function_name = "test-githubciosns-pre-playground"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>